# DeleteAllDLComponents

## Description
Deletes all components in the Double Line Preferences.

```pascal
FUNCTION DeleteAllDLComponents : BOOLEAN;
```

```python

def vs.DeleteAllDLComponents():
    return BOOLEAN
```

## Version
Availability: from VectorWorks12.5
## Category
* Document Settings